tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
bool readInt64Param(const char* name, int64_t& out) {
  char raw[24];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return false;
  }
  char* end = nullptr;
  const long long value = strtoll(raw, &end, 10);
  if (!end || *end != '\0') {
    return false;
  }
  out = static_cast<int64_t>(value);
  return true;
}

bool hasParam(const char* name) {
  return Esp32BaseWeb::hasParam(name);
}

bool readInt64ParamOptional(const char* name, int64_t& out) {
  char raw[24];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return true;
  }
  char* end = nullptr;
  const long long value = strtoll(raw, &end, 10);
  if (!end || *end != '\0') {
    return false;
  }
  out = static_cast<int64_t>(value);
  return true;
}

bool readUint32Param(const char* name, uint32_t& out) {
  char raw[16];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return false;
  }
  char* end = nullptr;
  const unsigned long value = strtoul(raw, &end, 10);
  if (!end || *end != '\0') {
    return false;
  }
  out = static_cast<uint32_t>(value);
  return true;
}

bool readUint32ParamOptional(const char* name, uint32_t& out) {
  return !Esp32BaseWeb::hasParam(name) || readUint32Param(name, out);
}

bool readBoolParam(const char* name, bool& out) {
  char raw[8];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return false;
  }
  if (strcmp(raw, "true") == 0 || strcmp(raw, "1") == 0) {
    out = true;
    return true;
  }
  if (strcmp(raw, "false") == 0 || strcmp(raw, "0") == 0) {
    out = false;
    return true;
  }
  return false;
}

void sendConfirmRequired(const char* action, const char* resource) {
  char token[9] = {};
  if (!g_confirm.issue(action, resource, millis(), esp_random(), token, sizeof(token))) {
    beginRawJson(500);
    Esp32BaseWeb::sendChunk("{\"result\":\"InvalidArgument\"}");
    endRawJson();
    return;
  }
  beginRawJson(409);
  Esp32BaseWeb::sendChunk("{\"result\":\"ConfirmRequired\",\"actionId\":\"");
  Esp32BaseWeb::sendChunk(action);
  Esp32BaseWeb::sendChunk("\",\"resource\":\"");
  Esp32BaseWeb::sendChunk(resource);
  Esp32BaseWeb::sendChunk("\",\"confirmToken\":\"");
  Esp32BaseWeb::sendChunk(token);
  Esp32BaseWeb::sendChunk("\",\"ttlMs\":60000}");
  endRawJson();
}

bool confirmAccepted() {
  bool confirm = false;
  return readBoolParam("confirm", confirm) && confirm;
}

bool requireConfirm(const char* action, const char* resource) {
  char token[16] = {};
  if (confirmAccepted() &&
      Esp32BaseWeb::getParam("confirmToken", token, sizeof(token)) &&
      g_confirm.consume(action, resource, token, millis())) {
    return true;
  }
  sendConfirmRequired(action, resource);
  return false;
}

int64_t openTargetPulsesFromTurnsX100(int64_t turnsX100) {
  return (kDefaultOutputPulsesPerRev * turnsX100) / 100;
}

int64_t turnsX100FromOpenTargetPulses(int64_t openTargetPulses) {
  return (openTargetPulses * 100) / kDefaultOutputPulsesPerRev;
}

int64_t defaultMaxRunPulsesForTarget(int64_t openTargetPulses) {
  return (openTargetPulses * 150) / 100;
}

bool readTrustLevelParam(PositionTrustLevel& out) {
  char raw[16];
  if (!Esp32BaseWeb::getParam("trustLevel", raw, sizeof(raw))) {
    out = PositionTrustLevel::Trusted;
    return true;
  }
  if (strcmp(raw, "Trusted") == 0 || strcmp(raw, "trusted") == 0) {
    out = PositionTrustLevel::Trusted;
    return true;
  }
  if (strcmp(raw, "Limited") == 0 || strcmp(raw, "limited") == 0) {
    out = PositionTrustLevel::Limited;
    return true;
  }
  if (strcmp(raw, "Untrusted") == 0 || strcmp(raw, "untrusted") == 0) {
    out = PositionTrustLevel::Untrusted;
    return true;
  }
  return false;
}

void applyRuntimeConfigFromBase() {
#if ESP32BASE_ENABLE_APP_CONFIG
  const int32_t speedPercent = Esp32BaseConfig::getInt("door", "speed", 60);
  const int32_t openTurnsX100 = Esp32BaseConfig::getInt("door", "openTurns", 500);
  const int32_t maxRunMs = Esp32BaseConfig::getInt("door", "maxRunMs", 25000);
  g_motorOutputEnabled = Esp32BaseConfig::getBool("door", "motorOutput", false);
  const bool requestedCurrentGuard =
      Esp32BaseConfig::getBool("door", "currentGuard", false);

  if (speedPercent >= 10 && speedPercent <= 100) {
    g_motorProfile.speedPercent = static_cast<uint8_t>(speedPercent);
  }
  if (openTurnsX100 > 0) {
    g_doorConfig.openTargetPulses = openTargetPulsesFromTurnsX100(openTurnsX100);
    g_doorConfig.maxRunPulses = defaultMaxRunPulsesForTarget(g_doorConfig.openTargetPulses);
    g_motorProtection.maxRunPulses = g_doorConfig.maxRunPulses;
  }
  if (maxRunMs > 0) {
    g_doorConfig.maxRunMs = static_cast<uint32_t>(maxRunMs);
    g_motorProtection.maxRunMs = g_doorConfig.maxRunMs;
  }
  const DoorSnapshot snapshot = g_door.snapshot();
  if (snapshot.state != DoorState::Opening && snapshot.state != DoorState::Closing) {
    g_door.configure(g_doorConfig);
  }
  if (g_motorOutputReady) {
    g_motor.configure(g_motorKinematics, g_motorProfile, g_motorProtection, g_motorStopPolicy);
  }
  g_currentGuard.enabled = ina240CompileEnabled() && requestedCurrentGuard;
#else
  g_motorOutputEnabled = false;
  g_currentGuard.enabled = false;
#endif
}

bool configureDoorMotorIfEnabled() {
  if (!g_motorOutputEnabled) {
    g_motorOutputReady = false;
    return false;
  }
  if (g_motorOutputReady) {
    return true;
  }
  Esp32EncodedDcMotor::MotorResult result = g_motorEncoder.begin(g_encoderBackend);
  if (result != Esp32EncodedDcMotor::MotorResult::Ok) {
    ESP32BASE_LOG_E("farmdoor", "motor_encoder_begin_failed result=%u",
                    static_cast<unsigned>(result));
    FarmAutoEventLog::recordStorageWarning("door_motor", "encoder_begin_failed",
                                           static_cast<uint16_t>(result));
    return false;
  }
  g_motorEncoder.resetPosition(g_door.snapshot().positionPulses);
  result = g_motorDriver.begin(FarmDoorHw.pins().motorIn1, FarmDoorHw.pins().motorIn2,
                               g_motorHardware);
  if (result != Esp32EncodedDcMotor::MotorResult::Ok) {
    ESP32BASE_LOG_E("farmdoor", "motor_driver_begin_failed result=%u",
                    static_cast<unsigned>(result));
    FarmAutoEventLog::recordStorageWarning("door_motor", "driver_begin_failed",
                                           static_cast<uint16_t>(result));
    return false;
  }
  result = g_motor.begin(g_motorDriver, g_motorEncoder, g_motorHardware, g_encoderBackend);
  if (result == Esp32EncodedDcMotor::MotorResult::Ok) {
    result = g_motor.configure(g_motorKinematics, g_motorProfile, g_motorProtection,
                               g_motorStopPolicy);
  }
  if (result != Esp32EncodedDcMotor::MotorResult::Ok) {
    ESP32BASE_LOG_E("farmdoor", "motor_begin_failed result=%u", static_cast<unsigned>(result));
    FarmAutoEventLog::recordStorageWarning("door_motor", "motor_begin_failed",
                                           static_cast<uint16_t>(result));
    return false;
  }
  g_motorOutputReady = true;
  return true;
}

DoorCommandResult startDoorMotorTo(int64_t targetPulses) {
  if (!configureDoorMotorIfEnabled()) {
    return DoorCommandResult::InvalidArgument;
  }
  const Esp32EncodedDcMotor::MotorResult result = g_motor.requestMoveToPosition(targetPulses);
  if (result == Esp32EncodedDcMotor::MotorResult::Ok) {
    return DoorCommandResult::Ok;
  }
  ESP32BASE_LOG_W("farmdoor", "motor_start_failed result=%u", static_cast<unsigned>(result));
  g_door.enterFault(DoorFaultReason::MotorFault);
  FarmAutoEventLog::recordDoorProtectionStopped("motor_start_failed", g_door.snapshot().positionPulses);
  return DoorCommandResult::FaultActive;
}

void sendMotorOutputJson() {
  Esp32BaseWeb::sendChunk("\"motorOutput\":{\"enabled\":");
  Esp32BaseWeb::sendChunk(boolJson(g_motorOutputEnabled));
  Esp32BaseWeb::sendChunk(",\"ready\":");
  Esp32BaseWeb::sendChunk(boolJson(g_motorOutputReady));
  if (g_motorOutputReady) {
    const Esp32EncodedDcMotor::MotorSnapshot motor = g_motor.snapshot();
    Esp32BaseWeb::sendChunk(",\"positionPulses\":");
    sendInt64(motor.positionPulses);
    Esp32BaseWeb::sendChunk(",\"targetPulses\":");
    sendInt64(motor.targetPulses);
    Esp32BaseWeb::sendChunk(",\"outputPercent\":");
    sendUint32(motor.driverOutputPercent);
    Esp32BaseWeb::sendChunk(",\"faultReason\":");
    sendUint32(static_cast<uint32_t>(motor.faultReason));
  }
  Esp32BaseWeb::sendChunk("}");
}

