tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
void updateDoorMotorRuntime() {
  if (!g_motorOutputReady) {
    return;
  }
  g_motor.update(millis());
  const DoorSnapshot door = g_door.snapshot();
  if (door.state != DoorState::Opening && door.state != DoorState::Closing) {
    return;
  }
  const Esp32EncodedDcMotor::MotorSnapshot motor = g_motor.snapshot();
  if (motor.state == Esp32EncodedDcMotor::MotorState::Idle) {
    if (g_door.onMotionTargetReached(motor.positionPulses) == DoorCommandResult::Ok) {
      persistDoorRecoveryStateIfReady();
    }
    return;
  }
  if (motor.state == Esp32EncodedDcMotor::MotorState::Fault) {
    g_door.enterFault(DoorFaultReason::MotorFault);
    FarmAutoEventLog::recordDoorProtectionStopped("motor_fault", motor.positionPulses);
    persistDoorRecoveryStateIfReady();
  }
}

DoorRecordTime currentRecordTime() {
  DoorRecordTime time;
#if ESP32BASE_ENABLE_NTP
  const Esp32BaseNtp::TimeSnapshot snapshot = Esp32BaseNtp::snapshot();
  time.unixTime = snapshot.synced ? snapshot.epochSec : 0;
  time.uptimeSec = snapshot.uptimeSec;
  time.bootId = snapshot.bootId;
#endif
  return time;
}

#if ESP32BASE_ENABLE_FS
bool appendDoorRecordBytes(const char* path, const uint8_t* data, std::size_t length, void*) {
  return Esp32BaseFs::appendBytes(path, data, length);
}

bool doorRecordPathExists(const char* path, void*) {
  return Esp32BaseFs::exists(path);
}

int64_t doorRecordFileSize(const char* path, void*) {
  return Esp32BaseFs::fileSize(path);
}

bool removeDoorRecordFile(const char* path, void*) {
  return Esp32BaseFs::removeFile(path);
}

bool renameDoorRecordFile(const char* from, const char* to, void*) {
  return Esp32BaseFs::rename(from, to);
}

bool readDoorRecordBytesAt(const char* path,
                           uint32_t offset,
                           uint8_t* out,
                           std::size_t maxLength,
                           std::size_t* readLength,
                           void*) {
  return Esp32BaseFs::readBytesAt(path, offset, out, maxLength, readLength);
}

bool ensureRecordStorageReady() {
  if (g_recordStorageReady) {
    return true;
  }
  if (!Esp32BaseFs::isReady()) {
    return false;
  }
  if (!Esp32BaseFs::exists(kDoorRecordRootDir) && !Esp32BaseFs::mkdir(kDoorRecordRootDir)) {
    return false;
  }
  if (!Esp32BaseFs::exists(kDoorRecordDir) && !Esp32BaseFs::mkdir(kDoorRecordDir)) {
    return false;
  }
  g_recordStorageReady = true;
  return true;
}
#endif

bool doorRecordPathForArchive(uint32_t archiveIndex, char* out, std::size_t outSize) {
  if (out == nullptr || outSize == 0 || archiveIndex > kDoorRecordMaxArchives) {
    return false;
  }
  const int written = archiveIndex == 0
                        ? snprintf(out, outSize, "%s", kDoorRecordCurrentPath)
                        : snprintf(out,
                                   outSize,
                                   "%s.%lu",
                                   kDoorRecordCurrentPath,
                                   static_cast<unsigned long>(archiveIndex));
  return written > 0 && static_cast<std::size_t>(written) < outSize;
}

void recordBusinessEvent(const DoorRecord& record) {
  const DoorRecord stored = g_records.append(record, currentRecordTime());
#if ESP32BASE_ENABLE_FS
  if (!ensureRecordStorageReady()) {
    return;
  }
  const DoorRecordRotateResult rotateResult =
      rotateDoorRecordPathIfNeeded(kDoorRecordCurrentPath,
                                   kDoorRecordMaxCurrentBytes,
                                   kDoorRecordMaxArchives,
                                   kDoorRecordEncodedMaxBytes,
                                   doorRecordFileSize,
                                   doorRecordPathExists,
                                   removeDoorRecordFile,
                                   renameDoorRecordFile,
                                   nullptr);
  if (rotateResult != DoorRecordRotateResult::Ok) {
    ESP32BASE_LOG_W("farmdoor", "record_rotate_failed result=%u",
                    static_cast<unsigned>(rotateResult));
    FarmAutoEventLog::recordStorageWarning("door_records",
                                           "rotate_failed",
                                           static_cast<uint16_t>(rotateResult));
  }
  const DoorRecordWriteResult result = appendDoorRecordToPath(
      stored, kDoorRecordCurrentPath, appendDoorRecordBytes, nullptr);
  if (result != DoorRecordWriteResult::Ok) {
    ESP32BASE_LOG_W("farmdoor", "record_append_failed result=%u",
                    static_cast<unsigned>(result));
    FarmAutoEventLog::recordStorageWarning("door_records",
                                           "append_failed",
                                           static_cast<uint16_t>(result));
  }
#endif
}

void sendRecordJson(const DoorRecord& record) {
  Esp32BaseWeb::sendChunk("{\"sequence\":");
  sendUint32(record.sequence);
  Esp32BaseWeb::sendChunk(",\"unixTime\":");
  sendUint32(record.unixTime);
  Esp32BaseWeb::sendChunk(",\"uptimeSec\":");
  sendUint32(record.uptimeSec);
  Esp32BaseWeb::sendChunk(",\"bootId\":");
  sendUint32(record.bootId);
  Esp32BaseWeb::sendChunk(",\"commandId\":");
  sendUint32(record.commandId);
  Esp32BaseWeb::sendChunk(",\"eventType\":\"");
  Esp32BaseWeb::sendChunk(recordTypeName(record.type));
  Esp32BaseWeb::sendChunk("\",\"result\":\"");
  Esp32BaseWeb::sendChunk(recordResultName(record.result));
  Esp32BaseWeb::sendChunk("\",\"command\":\"");
  Esp32BaseWeb::sendChunk(commandName(record.command));
  Esp32BaseWeb::sendChunk("\",\"oldPositionPulses\":");
  sendInt64(record.oldPositionPulses);
  Esp32BaseWeb::sendChunk(",\"newPositionPulses\":");
  sendInt64(record.newPositionPulses);
  Esp32BaseWeb::sendChunk(",\"oldTravelPulses\":");
  sendInt64(record.oldTravelPulses);
  Esp32BaseWeb::sendChunk(",\"newTravelPulses\":");
  sendInt64(record.newTravelPulses);
  Esp32BaseWeb::sendChunk(",\"deltaPulses\":");
  sendInt64(record.deltaPulses);
  Esp32BaseWeb::sendChunk("}");
}

void sendRecordSnapshotJson(const char* source) {
  const DoorRecordSnapshot snapshot = g_records.snapshot();
  beginRawJson(200);
  Esp32BaseWeb::sendChunk("{\"source\":\"");
  Esp32BaseWeb::sendChunk(source);
  Esp32BaseWeb::sendChunk("\",\"count\":");
  sendUint32(snapshot.count);
  Esp32BaseWeb::sendChunk(",\"records\":[");
  for (uint8_t i = 0; i < snapshot.count; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    sendRecordJson(snapshot.records[i]);
  }
  Esp32BaseWeb::sendChunk("]}");
  endRawJson();
}

const char* appEventLevelName(FarmAutoEventLog::Level level) {
  switch (level) {
    case FarmAutoEventLog::LEVEL_INFO: return "info";
    case FarmAutoEventLog::LEVEL_WARN: return "warn";
    case FarmAutoEventLog::LEVEL_ERROR: return "error";
  }
  return "info";
}

void sendBusinessEventJson(const FarmAutoEventLog::BusinessEvent& event) {
  Esp32BaseWeb::sendChunk("{\"id\":");
  sendUint32(event.id);
  Esp32BaseWeb::sendChunk(",\"epochSec\":");
  sendUint32(event.epochSec);
  Esp32BaseWeb::sendChunk(",\"bootId\":");
  sendUint32(event.bootId);
  Esp32BaseWeb::sendChunk(",\"uptimeSec\":");
  sendUint32(event.uptimeSec);
  Esp32BaseWeb::sendChunk(",\"timeSynced\":");
  Esp32BaseWeb::sendChunk(boolJson(event.timeSynced));
  Esp32BaseWeb::sendChunk(",\"level\":\"");
  Esp32BaseWeb::sendChunk(appEventLevelName(event.level));
  Esp32BaseWeb::sendChunk("\",\"domain\":\"");
  Esp32BaseWeb::writeJsonEscaped(event.domain);
  Esp32BaseWeb::sendChunk("\",\"action\":\"");
  Esp32BaseWeb::writeJsonEscaped(event.action);
  Esp32BaseWeb::sendChunk("\",\"target\":\"");
  Esp32BaseWeb::writeJsonEscaped(event.target);
  Esp32BaseWeb::sendChunk("\",\"message\":\"");
  Esp32BaseWeb::writeJsonEscaped(event.message);
  Esp32BaseWeb::sendChunk("\",\"detail\":\"");
  Esp32BaseWeb::writeJsonEscaped(event.detail);
  Esp32BaseWeb::sendChunk("\",\"code\":");
  sendUint32(event.code);
  Esp32BaseWeb::sendChunk(",\"valueMask\":");
  sendUint32(event.valueMask);
  Esp32BaseWeb::sendChunk(",\"value1\":");
  sendInt64(event.value1);
  Esp32BaseWeb::sendChunk(",\"value2\":");
  sendInt64(event.value2);
  Esp32BaseWeb::sendChunk(",\"value3\":");
  sendInt64(event.value3);
  Esp32BaseWeb::sendChunk("}");
}

struct BusinessEventJsonState {
  uint16_t emitted = 0;
};

void sendBusinessEventJsonCallback(const FarmAutoEventLog::BusinessEvent& event, void* user) {
  BusinessEventJsonState* state = static_cast<BusinessEventJsonState*>(user);
  if (state == nullptr) {
    return;
  }
  if (state->emitted > 0) {
    Esp32BaseWeb::sendChunk(",");
  }
  sendBusinessEventJson(event);
  ++state->emitted;
}

